const Paradoxes = [
  {
    id: "1",
    title: "פרדוקס ראסל, 1901",
    description: `.פרדוקס ראסל מתעורר מעיסוק בתורת הקבוצות הנאיבית, והוא אחד מהגורמים המרכזיים לפיתוח האקסיומות בבסיס תורת הקבוצות. הפרדוקס נולד מעיסוק בקבוצה המשתייכת לעצמה`,
    author: "ברטראנד ראסל",
    about:
      "ברטראנד ראסל הוא פילוסוף, לוגיקן וסופר בריטי. ראסל עסק במהלך חייו במספר תחומי עיסוק מגוונים, החל מאקטיביזם מדיני-חברתי, ועד למחקרים פילוסופיים בבסיס תורת הקבוצות. ראסל פרסם בין היתר את הספר 'פרינציפיה מתמטיקה' שנחשב לאחד הפרסומים המשמעותיים ביותר כחלק ממחקר יסודות המתמטיקה במאה ה-20.",
    content:
      "הפרדוקס של ראסל עוסק בשאלת 'קבוצה המשתייכת לעצמה': נחלק את כל הקבוצות לשני סוגים: נורמליות, שאינן מהוות איבר של עצמן; לא-נורמליות, אשר מהוות איבר של עצמן. תהא קבוצה X קבוצת כל הקבוצות הנורמליות. הפרדוקס נוצר מהשאלה הבאה: האם הקבוצה X היא נורמלית? מחד, אם X היא נורמלית, אזי מהגדרת X (קבוצת כל הקבוצות הנורמליות) מתקיים ש- X לא-נורמלית, וזאת סתירה; מאידך, אם X היא לא-נורמלית, אזי מההגדרה של X מתקיים ש-X נורמלית, וזאת סתירה!",
    image:
      "https://upload.wikimedia.org/wikipedia/commons/4/4f/Bertrand_Russell_%28c._April_1940%29.jpg",
    solution:
      "הפרדוקס נובע מהעיסוק בתורת הקבוצות הנאיבית, ובקשיים שהיא מעוררת. הגישה הרווחת כיום להתמודדות עימו, היא ההתבססות על תורת הקבוצות האקסיומטית. רוב המתמטיקאים בחרו לאורך השנים לאמץ את מערכת האקסיומות ZFC.",
  },
  {
    id: "2",
    title: "פרדוקס הספר",
    description: "הסנדלר הולך יחף? או, דווקא מכולם הספר לא מגולח?",
    author: "ברטראנד ראסל",
    about:
      "ברטראנד ראסל הוא פילוסוף, לוגיקן וסופר בריטי. ראסל עסק במהלך חייו במספר תחומי עיסוק מגוונים, החל מאקטיביזם מדיני-חברתי, ועד למחקרים פילוסופיים בבסיס תורת הקבוצות. ראסל פרסם בין היתר את הספר 'פרינציפיה מתמטיקה' שנחשב לאחד הפרסומים המשמעותיים ביותר כחלק ממחקר יסודות המתמטיקה במאה ה-20.",
    content: `בעירייה אחת גר לו ספר. והמלך של אותה עיירה החליט להעביר את החוק הבא: על כל תושבי העירייה להסתפר אצל הספר, מלבד אותם תושבים שמסוגלים לספר את עצמם; אלו אכן חייבים לספר את עצמם ואסור להם להסתפר אצל הספר. על פניו אין בעיה עם החוק הזה, מלבד אחת - איפה הספר עצמו יסתפר?
    כי מצד אחד, אם הוא אינו מסוגל לספר את עצמו אז על פי החוק הוא צריך להסתפר אצל עצמו; מצד שני, אם הוא כן מסוגל לספר את עצמו, אז על פי החוק אסור לו 
    `,
    image: "https://www.fajarmag.com/wp-content/uploads/2022/04/download-1.jpg",
    solution: `פרדוקס הספר הוא ניסוח פופולרי לפרדוקס ראסל שנובע מהעיסוק בתורת הקבוצות הנאיבית.  הפרדוקס של ראסל המריץ את הקהילה המתמטית לבנות למתמטיקה בסיס שעדיין יישען על תורת הקבוצות והלוגיקה, אבל יהיה נטול פרדוקסים. ארנסט צרמלו ואברהם הלוי פרנקל הציעו גישה אקסיומטית לתורת הקבוצות שהצליחה להימנע מפרדוקסים. מערכת זו היא הבסיס לתורת הקבוצות האקסיומטית.`,
  },
  {
    id: "3",
    title: "פרדוקס קנטור",
    description:
      "לאחר התגלית לפיה עוצמת קבוצה קטנה ממש מעוצמת קבוצת החזקה שלה, מהי עוצמת קבוצת כל הקבוצות?",
    author: "גיאורג קנטור, 1895-1899",
    about:
      "גיאורג קנטור הוא מתמטיקאי גרמני, שנחשב בין היתר לאבי תורת הקבוצת המודרנית. קנטור פיתח בין היתר את מושגי שוויון עוצמות בין קבוצות, והגדיר את ההבדלה בין עוצמות של קבוצות אינסופיות.",
    content: `נניח כי קיימת 'קבוצת כל הקבוצות', ונסמן אותה ב-X. כעת נתבונן בקבוצה P(X). לפי משפט קנטור, מתקיים:
    |P(X)| > |X|
    מנגד, X היא קבוצות כל הקבוצות, לכן P(X) שייכת ל-X, לכן:
    |P(X)|<=|X|
    סתירה!
    `,
    image:
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/A_href%3Dhttpwww.copyright.in_title%3DCopyright.in_-_Copyright_registration_and_fillingCopyright.in_-_Copyright_registration_and_fillinga.png/120px-A_href%3Dhttpwww.copyright.in_title%3DCopyright.in_-_Copyright_registration_and_fillingCopyright.in_-_Copyright_registration_and_fillinga.png",
    solution:
      "הפרדוקס נובע מהעיסוק בתורת הקבוצות הנאיבית, ובקשיים שהיא מעוררת. הגישה הרווחת כיום להתמודדות עימו, היא ההתבססות על תורת הקבוצות האקסיומטית. רוב המתמטיקאים בחרו לאורך השנים לאמץ את מערכת האקסיומות ZFC.",
  },
  {
    id: "4",
    title: "פרדוקס ברי",
    description:
      "הפרדוקס של ברי הוא פרדוקס הנובע מהגדרה מילולית של מספר, בצורה שלכאורה נוגדת את עצמה. ניסוח אפשרי שלו הוא חיפוש ”המספר הקטן ביותר שאיננו ניתן לתיאור באמצעות פחות ממאה אותיות”.",
    author: "ג'י. ג'י. ברי (1867–1928)",
    about: `ברטרנד ראסל, הראשון שדן בפרדוקס בדפוס, הוא ייחס אותו ל-G.G. Berry (1867–1928), ספרן זוטר בספריית בודליאן של אוקספורד. ראסל כינה את ברי "האדם היחיד באוקספורד שהבין לוגיקה מתמטית". הפרדוקס כונה גם "הפרדוקס של ריצ'רד" על ידי ז'אן-איב ז'ירארד.`,
    content: `ניתן להגדיר מספרים באמצעות מילים בעברית. לדוגמה, את 2 ניתן להגדיר בתור "המספר החיובי הזוגי הקטן ביותר", או למשל באמצעות המילה "שתיים". אנו מעוניינים בקבוצת כל המספרים הטבעיים שניתנים לתיאור על ידי מילה או צירוף מילים בני פחות מ-100 אותיות. נדרוש בנוסף עבור כל מספר שצירוף המילים יתאר אותו בלבד, ולא קבוצה אינסופית של מספרים (למשל "כל המספרים הטבעיים" אינו צירוף מילים שנתייחס אליו כמתאר מספר מסוים).

    כעת, מכיוון שהגבלנו את מספר האותיות לפחות מ-100, וקיים מספר סופי של אותיות בעברית, הרי שקיים מספר סופי של צירופי מילים, ומכאן שקיים מספר סופי בלבד של מספרים טבעיים שניתן לתאר על ידי פחות מ-100 אותיות. מכיוון שיש אינסוף מספרים טבעיים, נובע מכך שקבוצת המספרים הטבעיים שאינם ניתנים לתיאור על ידי פחות מ-100 אותיות איננה ריקה.
    
    כעת, על המספרים הטבעיים מוגדר יחס סדר טוב ולכן בכל תת-קבוצה של מספרים טבעיים קיים מספר שהוא הקטן ביותר, ובפרט בקבוצת המספרים שאינם ניתנים לתיאור על ידי פחות מ-100 אותיות. נתאר מספר זה על ידי צירוף המילים "המספר הקטן ביותר שאינו ניתן לתיאור באמצעות פחות ממאה אותיות".
    
    כעת הגענו לסתירה לכאורה, מכיוון שבצירוף המילים שבו השתמשנו כדי לתאר את המספר היו פחות ממאה אותיות.`,
    image:
      "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Bertrand_Arthur_William_Russell%2C_3rd_Earl_Russell.jpg/375px-Bertrand_Arthur_William_Russell%2C_3rd_Earl_Russell.jpg",
    solution: `שורש הפרדוקס הוא בעובדה שהמשפט שלנו מתייחס אל עצמו, מצב הגורר פרדוקסים לעיתים קרובות.

    כדי להבין את הבעייתיות בהתייחסות עצמית באופן חד יותר, נסתכל על המשפט "המספר המוגדר במשפט זה ועוד 1". במקרה זה הבעייתיות של המשפט ברורה מאליה, כך שאף אחד לא יתייחס אליו כפרדוקס - הוא מפנה אל תוצאת החישוב המוגדרת בו עצמו. התוצאה היא שאי אפשר לחשב את המספר ה"מוגדר" בו.
    
    במשפט "המספר הקטן ביותר שאינו ניתן לתיאור באמצעות פחות ממאה אותיות", ההתייחסות העצמית מסתתרת בעובדה שהוא מדבר על מספרים בני פחות ממאה אותיות בעוד שהוא עצמו אחד כזה. כדי לחדד את הנקודה, ניתן לנסח את המשפט כך: "המספר הקטן ביותר שאינו מוגדר במשפטים מסוג זה". הפעם ההתייחסות העצמית ברורה לחלוטין, והפרדוקס - איננו.`,
  },
  {
    id: "5",
    title: "המספרים המעניינים",
    description: `פרדוקס המספרים המעניינים הוא פרדוקס מילולי, הנובע מהגדרה של מספר טבעי בצורה שלכאורה סותרת את עצמה.
    הפרדוקס נובע מהסיווג של קבוצת המספרים הטבעיים למספרים "מעניינים" ולמספרים "לא מעניינים".`,
    author: `גוֹדפרִי הרוֹלד הַארדִי וסרִינִיוַאסה אִִיאנגאַר רַמנוּג'אַן `,
    about: `סרִינִיוַאסה אִִיאנגאַר רַמנוּג'אַן: (22 בדצמבר 1887 - 26 באפריל 1920) היה מתמטיקאי הודי, מגדולי המתמטיקאים בכל הזמנים, שחי בזמן השלטון הבריטי בהודו. למרות שלא עבר הכשרה פורמלית במתמטיקה עיונית, הוא תרם לאנליזה מתמטית, תורת המספרים, טורים, שברים משולבים, כולל פתרונות לבעיות שעד אז נחשבו לבלתי פתירות. בשנת 1913, לאחר חיפוש מתמטיקאים שיכירו בערך תגליותיו, התיידד עם המתמטיקאי הבריטי גודפרי הרולד הארדי. לאחר שהארדי זיהה את תגליותיו של רמנוג'אן, הוא ארגן את הגעתו לבריטניה.

    במהלך חייו הקצרים, רמנוג'אן גילה באופן בלתי תלוי כ-3,900 תגליות מתמטיות, רובן זהויות ומשוואות.
    גוֹדפרִי הרוֹלד הַארדִי (7 בפברואר 1877 – 1 בדצמבר 1947) היה מתמטיקאי בריטי חשוב, ידוע בהישגיו בתורת המספרים ובתחום של אנליזה מתמטית.`,
    content: `פרדוקס המספרים המעניין הוא פרדוקס מתמטי שנוצר כאשר שני מתמטיקאים הרדי וסריניוסה רמנוג'אן שוחחו על מספרים מעניינים ולא מעניינים.
    הרדי אמר לרמנוג'אן, "מס' המונית 1729 נראה לא מעניין". רמנוג'אן סתר שזה מעניין מכיוון שהוא המספר הקטן ביותר שניתן לבטאו כסכום של שתי חזקות שלישיות בשתי דרכים שונות.
    הפרדוקס הזה מנסה לסווג את המספרים הטבעיים לקבוצת מספרים מעניינת ולא מעניינת וההוכחה המתמטית ניתנה בסתירה.
    נניח שיש לנו קבוצה של מספרים טבעיים לא מעניינים אבל המספר הקטן ביותר באותה קבוצה יהיה מעניין מכיוון שהוא המספר הקטן ביותר ובכך מעלה סתירה.`,
    image: "https://i.ytimg.com/vi/UWXPk54i8vc/mqdefault.jpg",
    solution: `הבעיה הנעוצה בלב הפרדוקס היא המושג "מעניין", שאינו מוגדר היטב. ניתן, למשל, לטעון שהיות מספר כלשהו הקטן ביותר בקבוצת הלא-מעניינים אינה הופכת אותו למעניין. יתר על כן, לא ניתן מבחינה מתמטית להגדיר "מספר מעניין" בצורה כזו שאיבר שנמצא בקבוצת המספרים הלא-מעניינים יהיה מספר מעניין בעצמו, מבלי שבהגדרה עצמה תהיה סתירה. הדבר נובע מצורתה המעגלית של ההגדרה: המספר שאנו מוצאים בהוכחה בדרך השלילה הוא מעניין אם הוא לא-מעניין וגם הוא הקטן ביותר מבין הלא-מעניינים. מבחינה לוגית, אמירה זו דומה לאמירה "A הוא B אם A הוא לא B" שהיא סתירה. התייחסות עצמית מסוג זה ידועה במיוחד בפרדוקס השקרן.`,
  },
];

module.exports = { Paradoxes };
